---
kind: type
id: T:Autodesk.Revit.DB.PlanCircuit
source: html/9fdb77cb-c579-1cbd-71de-01f06a18ea3a.htm
---
# Autodesk.Revit.DB.PlanCircuit

An object that represents an enclosed area in a plan view within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class PlanCircuit : APIObject
```

## Remarks
Plan circuits are enclosed regions as seen on a plan view. They are used to determine the
boundary extents of rooms based on the placement of walls. In the Autodesk Revit API, you can use
plan circuits to create new rooms.